igalic/freebsd-src/share/man/man9/virtqueue.9
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.\" Copyright (c) 2023 The FreeBSD Foundation
.\"
.\" This manual page was written by Mina Galić <FreeBSD@igalic.co> under
.\" sponsorship from the FreeBSD Foundation.
.\"
.Dd August 8, 2023
.Dt VIRTQUEUE 9
.Os
.Sh NAME
.Nm virtqueue
.Nd "functions for accessing and manipulating virtqueues"
.Sh SYNOPSIS
.In dev/virtio/virtqueue.h
.Ss /* virtqueue allocation functions */
.Ft int
.Fo virtqueue_alloc
.Fa "device_t dev"
.Fa "uint16_t queue"
.Fa "uint16_t size"
.Fa "bus_size_t notify_offset"
.Fa "int align"
.Fa "vm_paddr_t highaddr"
.Fa "struct vq_alloc_info *info"
.Fa "struct virtqueue **vqp"
.Fc
.Ft void*
.Fo virtqueue_drain
.Fa "struct virtqueue *vq"
.Fa "int *last"
.Fc
.Ft void
.Fo virtqueue_free
.Fa "struct virtqueue *vq"
.Fc
.Ft int
.Fo virtqueue_reinit
.Fa "struct virtqueue *vq"
.Fa "uint16_t size"
.Fc
.Ss /* virtqueue interrupt callback functions */
.Ft int
.Fo virtqueue_intr_filter
.Fa "struct virtqueue *vq"
.Fc
.Ft void
.Fo virtqueue_intr
.Fa "struct virtqueue *vq"
.Fc
.Ft int
.Fo virtqueue_enable_intr
.Fa "struct virtqueue *vq"
.Fc
.Ft int
.Fo virtqueue_postpone_intr
.Fa "struct virtqueue *vq"
.Fa "vq_postpone_t hint"
.Fc
.Ft void
.Fo virtqueue_disable_intr
.Fa "struct virtqueue *vq"
.Fc
.Ss /* Get physical address of the virtqueue ring */
.Ft vm_paddr_t
.Fo virtqueue_paddr
.Fa "struct virtqueue *vq"
.Fc
.Ft vm_paddr_t
.Fo virtqueue_desc_paddr
.Fa "struct virtqueue *vq"
.Fc
.Ft vm_paddr_t
.Fo virtqueue_avail_paddr
.Fa "struct virtqueue *vq"
.Fc
.Ft vm_paddr_t
.Fo virtqueue_used_paddr
.Fa "struct virtqueue *vq"
.Fc
.Ss /* virtqueue size and index information functions */
.Ft uint16_t
.Fo virtqueue_index
.Fa "struct virtqueue *vq"
.Fc
.Ft bool
.Fo virtqueue_full
.Fa "struct virtqueue *vq"
.Fc
.Ft bool
.Fo virtqueue_empty
.Fa "struct virtqueue *vq"
.Fc
.Ft int
.Fo virtqueue_size
.Fa "struct virtqueue *vq"
.Fc
.Ft int
.Fo virtqueue_nfree
.Fa "struct virtqueue *vq"
.Fc
.Ft int
.Fo virtqueue_nused
.Fa "struct virtqueue *vq"
.Fc
.Ft void
.Fo virtqueue_notify
.Fa "struct virtqueue *vq"
.Fc
.Ft void
.Fo virtqueue_dump
.Fa "struct virtqueue *vq"
.Fc
.Ss /* Receive data from or send data to a virtqueue */
.Ft int
.Fo virtqueue_enqueue
.Fa struct virtqueue *vq
.Fa void *cookie
.Fa struct sglist *sg
.Fa "int readable"
.Fa "int writable"
.Fc
.Ft void*
.Fo virtqueue_dequeue
.Fa "struct virtqueue *vq"
.Fa "uint32_t *len"
.Fc
.Ft void*
.Fo virtqueue_poll
.Fa "struct virtqueue *vq"
.Fa "uint32_t *len"
.Fc
.Sh DESCRIPTION
The virtqueue functions provide an API into the most important VirtIO abstraction.
.Pp
The
.Fn virtqueue_alloc
function allocates a virtqueue using
.Xr malloc 9 ,
and assigning it the
.Xr device 9
dev.
Conversely,
.Fn virtqueue_free
frees the virtqueue.
.Sh EXAMPLES
.Bd -literal -offset indent
uint64_t cid = virtio_htog32(true, 0x2);
.Sh SEE ALSO
.Xr sglist 9 .
.Sh AUTHORS
This manual page was written by
.An Mina Galić .

